#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-ySeg4WhZidw79jkc

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=3c888834-46b1-435d-8cc1-5b1ac7992345]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=3c888834-46b1-435d-8cc1-5b1ac7992345]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]
helm_release.flagger: Refreshing state... [id=flagger]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.flagger must be replaced
-/+ resource "helm_release" "flagger" {
      ~ id                         = "flagger" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "1.21.0"
              - chart       = "flagger"
              - name        = "flagger"
              - namespace   = "linkerd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - meshProvider  = "linkerd"
                      - metricsServer = "http://prometheus.istio-system:9090"
                    }
                )
              - version     = "1.21.0"
            },
        ] -> (known after apply)
        name                       = "flagger"
      ~ namespace                  = "linkerd" -> "istio-system" # forces replacement
        # (24 unchanged attributes hidden)

      - set {
          - name  = "metricsServer" -> null
          - value = "http://prometheus.istio-system:9090" -> null
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus.linkerd-viz:9090"
        }
        # (1 unchanged block hidden)
    }

  # helm_release.istio-base will be created
  + resource "helm_release" "istio-base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio-ingress will be created
  + resource "helm_release" "istio-ingress" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-ingress"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio-istiod will be created
  + resource "helm_release" "istio-istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-istiod"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.14.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus-stack will be created
  + resource "helm_release" "prometheus-stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus-stack"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "35.5.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.openarabic will be updated in-place
  ~ resource "kubernetes_namespace" "openarabic" {
        id = "openarabic"

      ~ metadata {
          ~ labels           = {
              + "istio-injection"   = "enabled"
              - "linkerd.io/inject" = "enabled" -> null
            }
            name             = "openarabic"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*